In [1]:
import pandas as pd
import numpy as np

In [2]:
drinks_df = pd.read_csv('../data/drinks-by-country.csv', index_col = 'country')
drinks_df.head(3)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa

In [3]:
titanic_df = pd.read_csv('../data/titanic.csv')
titanic_df.columns = titanic_df.columns.str.lower()
titanic_df.head(3)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

# Map

**Works on a Series**

In [4]:
titanic_df.sex = titanic_df.sex.map({'male': 1, 'female': 0})
titanic_df.head(3)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

# Apply
**Works Column / Row wise**

In [5]:
# Let's calculate the length of passenger's name
titanic_df['name_len'] = titanic_df.name.apply(len)
titanic_df.loc[:3, ['name', 'name_len']]

                                                name  name_len
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                             Heikkinen, Miss. Laina        22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)        44

In [6]:
titanic_df['fare_ceil'] = titanic_df.fare.apply(np.ceil)
titanic_df.loc[:3, ['fare', 'fare_ceil']]

      fare  fare_ceil
0   7.2500        8.0
1  71.2833       72.0
2   7.9250        8.0
3  53.1000       54.0

In [7]:
# Let's check all the Surname counts

titanic_df.name.str.split(',').apply(lambda x: x[0]).value_counts().head()

Andersson    9
Sage         7
Carter       6
Panula       6
Goodwin      6
Name: name, dtype: int64

In [8]:
# Let's see if Beer, Spirit or Wine was served more per country
drinks_df.loc[:, ['beer_servings', 'spirit_servings', 'wine_servings']].apply(np.argmax, axis = 1).head()

country
Afghanistan      beer_servings
Albania        spirit_servings
Algeria          beer_servings
Andorra          wine_servings
Angola           beer_servings
dtype: object

# Apply Map
**Works element wise**

In [9]:
drinks_df.loc[:, 'beer_servings' : 'wine_servings'].applymap(float).head()

             beer_servings  spirit_servings  wine_servings
country
Afghanistan            0.0              0.0            0.0
Albania               89.0            132.0           54.0
Algeria               25.0              0.0           14.0
Andorra              245.0            138.0          312.0
Angola               217.0             57.0           45.0